#8.7
x=int(input("nhập số điện :"));
if(x>0 and x<=50):
    td=x*1.678
    print("số tiền điện là :",td )
elif(x>=51 and x<=100):
    td=(50*1.678)+((x-50)*1.734)
    print("số tiền điện là :",td )
elif(x>=101 and x<=200):
    td=(50*1.678)+(50*1.734)+((x-100)*2.014)
    print("số tiền điện là :",td )
elif(x>=201 and x<=300):
    td=(50*1.678)+(50*1.734)+(100*2.014)+((x-200)*2.536)
    print("số tiền điện là :",td )
elif(x>=301 and x<=400):
    td=(50*1.678)+(50*1.734)+(100*2.014)+(100*2.536)+((x-300)*2.834)
    print("số tiền điện là :",td )
else:
    td=(50*1.678)+(50*1.734)+(100*2.014)+(100*2.536)+(100*2.834)+((x-400)*2.927)
    print("số tiền điện là :",td )